# VS Code extensions installed on every machine (one id per line).
anthropic.claude-code
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
dbaeumer.vscode-eslint
dprint.dprint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
github.vscode-pull-request-github
jinliming2.vscode-go-template
jnoortheen.nix-ide
mkhl.direnv
ms-playwright.playwright
nefrob.vscode-just-syntax
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
thenuprojectcontributors.vscode-nushell-lang
tombi-toml.tombi
vitest.explorer
